// spots.js（2026年1月）
window.spots = [
  {
    name: "ドラムの里（千葉県印旛郡栄町龍角寺1039-1）",
    date: "1/3(土)",
    lat: 35.823447,
    lng: 140.273911
  },
  {
    name: "水元公園",
    date: "1/4(日)",
    lat: 35.786408,
    lng: 139.869253
  },

  {
    name: "ダイナム戸ヶ崎店",
    date: "1/6(火)",
    lat: 35.7990108,
    lng: 139.86757478
  },
  {
    name: "獨協大学 草加キャンパス（のり弁）",
    date: "1/7(水)",
    lat: 35.839861,
    lng: 139.794333
  },
  {
    name: "聖路加国際大学",
    date: "1/8(木)",
    lat: 35.667876,
    lng: 139.775819
  },

  {
    name: "東綾瀬公園",
    date: "1/10(土)",
    lat: 35.769967,
    lng: 139.8325366
  },
  {
    name: "渋谷蚤の市（渋谷区南平台町16-17）",
    date: "1/11(日)",
    lat: 35.6539804,
    lng: 139.6936391
  },

  {
    name: "川口さくら病院（川口市神戸258-1／のり弁）",
    date: "1/13(火)",
    time: "11:00-14:00",
    lat: 35.852048,
    lng: 139.724747
  },
  {
    name: "獨協大学 草加キャンパス",
    date: "1/14(水)",
    lat: 35.839861,
    lng: 139.794333
  },
  {
    name: "蕨市役所（のり弁）",
    date: "1/15(木)",
    lat: 35.82558,
    lng: 139.6795603
  },

  {
    name: "都立亀戸中央公園",
    date: "1/17(土)",
    lat: 35.7007507,
    lng: 139.8361199
  },
  {
    name: "さいたま市子ども家庭総合センター",
    date: "1/18(日)",
    lat: 35.885611,
    lng: 139.644083
  },

  {
    name: "ダイナム戸ヶ崎店",
    date: "1/20(火)",
    lat: 35.7990108,
    lng: 139.86757478
  },
  {
    name: "さいたま市役所 浦和本庁舎（のり弁）",
    date: "1/21(水)",
    lat: 35.861670,
    lng: 139.645280
  },
  {
    name: "埼玉東萌短期大学（星城入試／広報課さま昼食）",
    date: "1/22(木)",
    lat: 35.869881,
    lng: 139.780239
  },

  {
    name: "いちかわごちそうマルシェ",
    date: "1/24(土)",
    lat: 35.71056,
    lng: 139.92861
  },
  {
    name: "シャリエ朝霞 グランフィールド",
    date: "1/25(日)",
    lat: 35.787996103978,
    lng: 139.5924669767
  },

  {
    name: "川口さくら病院（川口市神戸258-1／のり弁）",
    date: "1/27(火)",
    time: "11:00-14:00",
    lat: 35.852048,
    lng: 139.724747
  },
  {
    name: "品川区役所 総合庁舎（のり弁）",
    date: "1/28(水)",
    lat: 35.609170,
    lng: 139.730170
  },
  {
    name: "聖路加国際大学",
    date: "1/29(木)",
    lat: 35.667876,
    lng: 139.775819
  },

  {
    name: "東綾瀬公園",
    date: "1/31(土)",
    lat: 35.769967,
    lng: 139.8325366
  }
];
