window.spots = [
  {
    name: '川口さくら病院',
    date: '12/2(火)',
    time: '11:00-14:00',
    lat: 35.852048,
    lng: 139.724747
  },
  {
    name: '獨協大学 草加キャンパス',
    date: '12/3(水)',
    lat: 35.839861,
    lng: 139.794333
  },
  {
    name: 'さいたま市役所 浦和本庁舎',
    date: '12/4(木)',
    lat: 35.861670,
    lng: 139.645280
  },
  {
    name: '小さな森の家 取手東',
    date: '12/6(土)',
    lat: 35.896551,
    lng: 140.064979
  },
  {
    name: '江戸ONIGIRI祭り（レインボーライド2025 マルチスポーツ会場）',
    date: '12/7(日)',
    lat: 35.623443,
    lng: 139.774954
  },
  {
    name: 'ダイナム戸ヶ崎店',
    date: '12/9(火)',
    lat: 35.799009,
    lng: 139.867562
  },
  {
    name: '獨協大学 草加キャンパス',
    date: '12/10(水)',
    lat: 35.839861,
    lng: 139.794333
  },
  {
    name: 'さいたま市役所 浦和本庁舎',
    date: '12/11(木)',
    lat: 35.861670,
    lng: 139.645280
  },
  {
    name: '保護犬譲渡会（MEGUROMARC GARDEN中央広場）',
    date: '12/14(日)',
    lat: 35.628741,
    lng: 139.717561
  },
  {
    name: '川口さくら病院',
    date: '12/16(火)',
    time: '11:00-14:00',
    lat: 35.852048,
    lng: 139.724747
  },
  {
    name: '獨協大学 草加キャンパス',
    date: '12/17(水)',
    lat: 35.839861,
    lng: 139.794333
  },
  {
    name: '杉並区 こども支援（会場未定）',
    date: '12/19(金)'
  },
  {
    name: '立教大学 池袋キャンパス',
    date: '12/20(土)',
    lat: 35.730480,
    lng: 139.704033
  },
  {
    name: '花栗子育てひろば（かなたけサンタ）',
    date: '12/24(水)',
    lat: 35.839039,
    lng: 139.788236
  },
  {
    name: 'さいたま市役所 浦和本庁舎',
    date: '12/25(木)',
    lat: 35.861670,
    lng: 139.645280
  },
  {
    name: '川口さくら病院',
    date: '12/30(火)',
    time: '11:00-14:00',
    lat: 35.852048,
    lng: 139.724747
  },
  {
    name: 'ダイナム戸ヶ崎店',
    date: '12/31(水)',
    lat: 35.799009,
    lng: 139.867562
  }
];
